// কোনো একটি সংখ্যা দুই দিয়ে সমান সমান ভাগ যায়, 
// এবং ভাগ শেষ থাকে না সেটা হলো জোড় সংখ্যা
// 208 লাস্ট ডিজিটের সংখ্যা যদি দুই দিয়ে ভাগ করলে...
// যদি ভাগ শেষ না থাকে তাহলে জোড়

//যদি কোনো একটি সংখ্যাকে দুই দিয়ে ভাগ করি তাহলে  ভাগ শেষ... 
//জিরো হয় তাহলে জোর সংখ্যা/even

//যদি কোনো একটি সংখ্যাকে দুই দিয়ে ভাগ করি তাহলে  ভাগ শেষ... 
//এক হয় তাহলে বিজোর সংখ্যা/odd


// console.log(8/2);
// console.log(98/2);
// console.log(114/2);
// console.log(220/2);

// //মোডুলাছ সাইন
// console.log(8%2);
// console.log(98%2);
// console.log(114%2);
// console.log(220%2);

// console.log(7/2);
// console.log(7/2);
// console.log(113/2);
// console.log(219/2);

console.log(7%2);
console.log(7%2);
console.log(113%2);
console.log(219%2);